<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"95f2ecf54d3bffc172a2161087000b45139fb6a2eb02ced02e45b080ea75b617","plan_job_ref":"Job Staging Image Build & Push #26 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7328701245","plan_hash":"4dedd978724905c1165de2de759c83768edbd0a1c0426e44ef18b7a49d88f0c4","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image:1" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.service must be replaced
-/+ resource "aws_ecs_task_definition" "service" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image:1" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
-                   mountPoints  = []
!~                  name         = "fastapi" -> "fastapi-Staging"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "************************" -> (known after apply)
!~      revision                 = 1 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #26](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7328701245)